/* Модуль подсчета crc сумм
 * обновлен.....................................................................09.11.2010 18:11:11
*/


#ifndef CRC_H_
#define CRC_H_

#include "pdef.h"

//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------

uint8_t crc_Count_Crc8(const uint8_t din[], ubase_t dsize);						//---выщитывает однобайтовую контрольную сумму
uint16_t crc_Count_Crc16(const uint8_t din[], ubase_t dsize);					//---выщитывает двобайтную контрольную сумму
void crc_Count_NextCrc16(const uint8_t din[], ubase_t dsize, uint16_t* crc);	//---выщитывает двобайтную контрольную сумму с добавлением

#endif

