//------------------------------------------------------------------------------
//IIC адрес устройства
//------------------------------------------------------------------------------

#define DS1631C_DEV_ADR							0x90

//------------------------------------------------------------------------------
//варианты типа сигнала на выходе
//------------------------------------------------------------------------------

	#define ___DS1631C_POL_HI					0x02							//выходной сигнал "1"
	#define ___DS1631C_POL_LO					0x00							//выходной сигнал "0"
#define DS1631C_POL								___DS1631C_POL_HI

//------------------------------------------------------------------------------
//варианты типа измерения
//------------------------------------------------------------------------------

	#define ___DS1631C_MEAS_SHOT					0x01						//единичное измерение
	#define ___DS1631C_MEAS_CONT					0x00						//постоянное измерение
#define DS1631C_MEAS							___DS1631C_MEAS_CONT

//------------------------------------------------------------------------------
//варианты разрешения
//------------------------------------------------------------------------------

	#define ___DS1631C_R09						0x00							//разрешение 9 бит	(93.75 ms)	
	#define ___DS1631C_R10						0x04							//разрешение 10 бит	(187.5 ms)
	#define ___DS1631C_R11						0x08							//разрешение 11 бит	(375 ms)
	#define ___DS1631C_R12						0x0C							//разрешение 12 бит	(750 ms)
#define DS1631C_RES								___DS1631C_R12


