/* Модуль мк памяти FM24C64
 * тип интерфейса...............................................................iic
 * обновлен.....................................................................10.11.2010 15:53:36
*/


#include "pdef.h"

//------------------------------------------------------------------------------
//порты
//------------------------------------------------------------------------------

#define PRT_PORT_0								PORTB							//порт для вкл./отк. защиты
#define PRT_DDR_0								DDRB
#define PRT_B_0									5

#define PRT_PORT_1								PORTB							//порт для вкл./отк. защиты
#define PRT_DDR_1								DDRB
#define PRT_B_1									7

#define PRT_PORT_2								PORTB							//порт для вкл./отк. защиты
#define PRT_DDR_2								DDRB
#define PRT_B_2									7

//------------------------------------------------------------------------------
//всякие константы
//------------------------------------------------------------------------------

#define FM24C64_ADR_0							0xA2
#define FM24C64_ADR_1							0xA0
#define FM24C64_ADR_2							0xA4

#define FM24C64_SIZE							8192

//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------

void fm24c64_Ini(void);															//---инициализация микросхемы памяти памяти
bool fm24c64_Open(uint8_t dev_adr, uint16_t adr, dir_t dir);						//---открывает память
bool fm24c64_Tx_Byte(uint8_t byte);												//---передает байт
void fm24c64_Rx_Byte(uint8_t* byte);											//---принимает байт
void fm24c64_Close(dir_t dir);													//---обрывает связь с памятю

																				//---
#define FM24C64_ON_PROTECT(NUM)													\
{																				\
	SETB(PRT_DDR_##NUM, PRT_B_##NUM);											\
	SETB(PRT_PORT_##NUM, PRT_B_##NUM);											\
}
																				//---
#define FM24C64_OFF_PROTECT(NUM)												\
{																				\
	SETB(PRT_DDR_##NUM, PRT_B_##NUM);											\
	CLRB(PRT_PORT_##NUM, PRT_B_##NUM);											\
}

