/* Модуль програмного iic (i2c)
 * обновлен.....................................................................16.11.2010 15:59:11
*/

#include "pdef.h"

//------------------------------------------------------------------------------
//конфигурация
//------------------------------------------------------------------------------

#define ___I2C_400000	400000
#define ___I2C_100000	100000
#define I2C_MSR_FRQ     					___I2C_400000						//опеределение частоты передачи в Гц. Может быть только 100000 или 400000

//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------

void iic_Ini(void);																//---инициализация I2C
bool iic_Open(uint8_t dev, dir_t direct);										//---начинает связь
bool iic_Tx_Byte(uint8_t byte);													//---записывает байт
void iic_Rx_Byte(uint8_t *byte, ubase_t ACK);									//---считывает байт
void iic_Close(void);															//---обрывает связь


