/* Модуль с математическими функциями
 * обновлен.....................................................................29.12.2010
*/

#include "pdef.h"

#ifndef MAT_H_
#define MAT_H_

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------

#define MAT_PI						3.14159265358979323846

//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------

int32_t mat_Round_FL64(fl64_t num);												//---округляет число типа float до целого числа
fl32_t mat_Mod_FL32(fl32_t num);												//---выдает модуль с float числа num
uint16_t mat_Mod_INT16S(int16_t num);											//---возвращает модуль с числа INT16S
uint32_t mat_Mod_INT32S(int32_t num);											//---возвращает модуль с числа INT32S
uint32_t mat_Average(uint32_t* data, uint8_t dsize);							//---возвращает усредненное значение, желательно, чтобы при dsize = 256, data =< 0xffffff

#endif
