/* Исполнительный модуль меню
 * проект.......................................................................БАЗОВЫЙ МОДУЛЬ КАЛИБРАТОРА
 * обновлен.....................................................................22.12.2010 12:47:12
*/

#include "tdf.h"
#include "menucore/usr.h"

//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//строки
//------------------------------------------------------------------------------
void mopr_Disp_Str_Time(const USRC_STR_ *str, time_t* time);						//---отображает строку + время
void mopr_Disp_Str_Date(date_t* date, day_t day, ubase_t strtype);					//---отображает строку + дату с днем недели
void mopr_Disp_CheckmarkStr(const USRC_STR_ *str, bool state);					//---отображает строку с знаком выбора
void mopr_Disp_RadioStr(const USRC_STR_ *str, bool state);						//---отображает строку с знаком переключателя
void mopr_Disp_MelodyType(ubase_t melody);										//---отображает мелодия тип
void mopr_Disp_FiltrType(ubase_t repiting);										//---отображает повтор тип
void mopr_Disp_AboutRmd(void);													//---выводит инвформация о напоминалке
void mopr_Disp_OnDays(day_t day);												//---отображает включенные дни
void mopr_Disp_RtcTime(void);													//---тображает время часов
void mopr_Disp_RtcTimeDate(void);                                               //---тображает время часов с датой
void mopr_Disp_RtcDate(void);													//---отображает дату часов
const USRC_STR_* mopr_DayStr(day_t day);											//---выдает строку соответствующую дню недели
//------------------------------------------------------------------------------
//ALM
//------------------------------------------------------------------------------
void mopr_Set_Day(const USRC_STR_ *str_day, day_t wday);							//---устанавливает день недели и отображает
//------------------------------------------------------------------------------
//SGN
//------------------------------------------------------------------------------
void mopr_Set_Melody(void);														//---устанавливает мелодию и отображает
//------------------------------------------------------------------------------
//RMD
//------------------------------------------------------------------------------
void mopr_Set_RmdFiltr(const USRC_STR_ *str_r, ubase_t f);							//---устанавливает повторение и отображает

void mopr_ListUpDown_Num(ubase_t max);											//---листает номер сущности up или down

