/* Драйвер часов реального времени PCF8583
 * интерфейс....................................................................iic
 * обновлен.....................................................................27.12.2010 12:01:50
*/

#include "pdef.h"
#include "tdf.h"

//------------------------------------------------------------------------------
//коды ошибок
//------------------------------------------------------------------------------

#define pcf8583_TRUE								0							//все OK
#define pcf8583_LINK								1							//потеря связи с часами
#define pcf8583_LOST								2							//параметр утерян не сходится CRC

//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------

bool pcf8583_Ini(void);															//---инициализация
bool pcf8583_Wr_Time(time_t *time);												//---настраивает время
bool pcf8583_Rd_Time(time_t *time);												//---читает время
bool pcf8583_Wr_Date(date_t *date);												//---настраивает дату, если date.day = 0, не изменять день недели
bool pcf8583_Rd_Date(date_t* date, day_t* day);									//---читает дату
bool pcf8583_Wr_Alarm(time_t *time);												//---настраивает будильник, совпадания по времени каждый день
bool pcf8583_Rd_Alarm(time_t *time);												//---считывает время будильника
bool pcf8583_Off_Alarm(void);													//---запрещает будильник




