/* Модуль с програмными таймерами
 * проект.......................................................................БАЗОВЫЙ МОДУЛЬ КАЛИБРАТОРА
 * обновлен.....................................................................14.11.2010 23:03:03
*/


//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------

void ptimer_Ini(void);															//---инициализирует програмные таймера
void ptimer(void);																//---проверка програмных таймеров
