/* Файл ресурсов
 * обновлен.....................................................................06.12.2010 13:23:08
*/

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------

#define RES_IS_ALM								1								//определяет - это будильник
#define RES_IS_TMR								2								//определяет - это таймер
#define RES_IS_TRG								3								//определяет - это терморегулятор
#define RES_IS_RMD								4								//определяет - это напоминалка
#define RES_IS_MENU								5								//определяет - это меню
#define RES_IS_MSG								6								//определяет - это сообщение
#define RES_IS_STW								7								//определяет - это обратный секундомер
#define RES_IS_RTC								8								//определяет - это RTC
#define RES_IS_TMP								9								//определяет - это датчики температуры
#define RES_IS_REST								10								//остальное

