/* Модуль описания напоминалок
 * обновлен.....................................................................10.12.2010 16:09:22
*/

#include "tdf.h"

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------

#define RMD_NUM									99

//------------------------------------------------------------------------------
//типы
//------------------------------------------------------------------------------

#define RMD_FILTR_MONTH							1
#define RMD_FILTR_YEAR							2
#define RMD_FILTR_OFF							3

//------------------------------------------------------------------------------
//биты
//------------------------------------------------------------------------------

#define RMD_STATE_B								0
#define RMD_NEAR_B								1
#define RMD_STOP_B								2
#define RMD_RING_B								3
#define RMD_WAITE_B								4

//------------------------------------------------------------------------------
//типы
//------------------------------------------------------------------------------

#ifndef RMD
#define RMD
typedef struct
{
	ubase_t state;																//отображает состояние вкл/отк
	time_t time;																	//служебное время для срабатывания
	uint8_t repnum;																//количество повторов
	uint8_t melody;																//мелодии
	date_t dateon;																//дата срабатывания
	ubase_t filtr;																//фильтр по месяцам, годам, одиночный
} grmd_t;
#endif

extern grmd_t gRmd[RMD_NUM];

//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------

void rmd_Ini(void);
void rmd(void);
bool rmd_On(ubase_t rnum);														//---включает напоминалку
bool rmd_Off(ubase_t rnum);														//---отключает напоминалку
bool rmd_Reset(ubase_t rnum);													//---перезапускает будильник
void rmd_Reset_Ring(ubase_t rnum);												//---сбрасывает текущий звонок напоминалки
bool rmd_Set_DateOn(ubase_t rnum, date_t* date);									//---устанавливает дату срабатывания
bool rmd_Set_Filtr(ubase_t rnum, uint8_t f);										//---устанавливает повторение
bool rmd_Set_Melody(ubase_t rnum, uint8_t melody);								//---устанавливает мелодию
bool rmd_Set_TimeOn(ubase_t rnum, time_t* time_on);								//---устанавливает время срабатывания
bool rmd_Set_TimeDur(ubase_t rnum, time_t* time_dur);								//---устанавливает время работы
bool rmd_Set_TimeRep(ubase_t rnum, time_t* time_rep);								//---устанавливает время повтора
bool rmd_Set_Repnum(ubase_t rnum, uint8_t repnum);								//---устанавливает количество повторов
void rmd_Default(ubase_t rnum);													//---по умолчанию значения напоминалки
void rmd_Resignal(ubase_t i);													//---пересигналить
bool rmd_State(ubase_t rnum);													//---узнать статус напоминалки, 3 - в сработанном состоянии, 2 - в несработанном состоянии

