/* Модуль для работы с таймерами
 * обновлен.....................................................................22.11.2010 20:59:26
*/

#include "tdf.h"

//------------------------------------------------------------------------------
//порты
//------------------------------------------------------------------------------

#define TMR_SIGNAL_PORT							PORTF
#define TMR_SIGNAL_DDR							DDRF
#define TMR_SIGNAL_PIN							PINF

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------

#define TMR_NUM											8						//количество таймеров

//------------------------------------------------------------------------------
//типы
//------------------------------------------------------------------------------

typedef struct
{
	uint8_t state_vector;														//отображает состояние вкл/отк
	uint8_t type_vector;														//типы выходов таймера
	time_t timeon[TMR_NUM];														//служебное время для срабатывания
	time_t timeoff[TMR_NUM];														//служебное время для срабатывания
	day_t day[TMR_NUM];															//дни недели
} gtmr_t;

extern gtmr_t gTmr;

//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------

void tmr_Ini(void);
void tmr(void);
bool tmr_On(ubase_t tnum);														//---включает таймер
bool tmr_Off(ubase_t tnum);														//---отключает таймер
bool tmr_Set_Day(ubase_t tnum, day_t day);										//---устанавливает дни недели
bool tmr_Set_Type(ubase_t tnum, uint8_t type);									//---устанавливает тип выходного сигнала
bool tmr_Set_TimeOn(ubase_t tnum, time_t* timeon);								//---задать время включения
bool tmr_Set_TimeOff(ubase_t tnum, time_t* timeoff);								//---задать время тключения
void tmr_Default(ubase_t tnum);													//---по умолчанию значения таймера
bool tmr_OutState(ubase_t tnum);													//---проверяет выхода таймеров
