/* Модуль для работиы с термостатами
 * обновлен.....................................................................08.12.2010 18:26:25
*/

#include "pdef.h"

//------------------------------------------------------------------------------
//порты
//------------------------------------------------------------------------------

#define TRM_1_PORT									PORTC
#define TRM_1_DDR									DDRC
#define TRM_1_B										0

#define TRM_2_PORT									PORTC
#define TRM_2_DDR									DDRC
#define TRM_2_B										1

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------

#define TRG_NUM										2

//------------------------------------------------------------------------------
//типы
//------------------------------------------------------------------------------

#ifndef TRG
#define TRG
typedef struct
{
	uint8_t state_vector;														//статусы терморегуляторов
	uint8_t type_vector;														//типы выходов терморегуляторов
	int16_t tbottom[TRG_NUM];													//нижняя граница темп.
	int16_t ttop[TRG_NUM];														//верхняя граница темп.
} gTRG_;
#endif

extern gTRG_ gTrg;

//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------

void trg_Ini(void);
void trg(void);
bool trg_On(ubase_t tnum);														//---включает терморегулятор
bool trg_Off(ubase_t tnum);														//---выключает терморегулятор
bool trg_Set_Tbottom(ubase_t tnum, int16_t tbottom);								//---устанавливает tbottom
bool trg_Set_Ttop(ubase_t tnum, int16_t ttop);									//---устанавливает ttop
bool trg_Set_Type(ubase_t tnum, uint8_t type);									//---устанавливает type
void trg_Default(ubase_t tnum);													//---по умолчанию значения терморегулятора
bool trg_OutState(ubase_t tnum);													//---узнает включен ли выход у данного термостата


