/* Модуль конфигурирования пользовательского интерфейса
 * обновлен.....................................................................07.03.2011 20:10:34
*/

#include "pdef.h"
#include "dsp/dsp.h"

#ifndef USRC_H_
#define USRC_H_
//------------------------------------------------------------------------------
//описание
//------------------------------------------------------------------------------
// 1) настройка глобальных горячих клавиш позволяет непосредственно задать горячие
// клавиши, которые будуть задействованы на рабочем столе, в меню и сообщениях
//
// 2) настройка горячих клавиш рабочего стола позволяет непосредственно настроить
// горячие клавишы рабочего стола
//
// 3) настройка клавиш навигации позволяет натсроить соответствия функций навигации
// кодам, которые выдает драйвер клавиатуры
//
// 4) настройка текстового редактора позволяет задать тип буфера для ввода текста
// и основной язык ввода текста, вторым языком по умолчанию являеться английский
//
// 5) настройка остальных параметров включает в себя:
//	- использование сообщения типа ASK
//  - размер стека возвращения из меню
//  - размер видимимой строки (строки без учета символов на статус панель, обычно из DSP)
//  - размер строки ввода
//  - спецификатор памяти расположения строк
//  - спецификатор памяти расположения окон
//
//------------------------------------------------------------------------------
//горячие клавиши глобальные
//------------------------------------------------------------------------------

#define USRC_USE_SUCH_GHOTKEY_1							'a'						//глобальные горячие клавиши, 0 - нету, 'символ' - есть
#define USRC_USE_SUCH_GHOTKEY_2							'd'
#define USRC_USE_SUCH_GHOTKEY_3							'.'
#define USRC_USE_SUCH_GHOTKEY_4							0
#define USRC_USE_SUCH_GHOTKEY_5							0

//------------------------------------------------------------------------------
//горячие клавиши рабочего стола
//------------------------------------------------------------------------------

#define USRC_USE_WRT_SUCH_HOTKEY_1						'1'						//горячие клавиши рабочего стола, 0 - нету, 'символ' - есть
#define USRC_USE_WRT_SUCH_HOTKEY_2						'3'
#define USRC_USE_WRT_SUCH_HOTKEY_3						'7'
#define USRC_USE_WRT_SUCH_HOTKEY_4						'9'
#define USRC_USE_WRT_SUCH_HOTKEY_5						0

//------------------------------------------------------------------------------
//клвиши навигации
//------------------------------------------------------------------------------

#define USRC_USE_ENTERKEY_2								1						//использование альтернативной клавиши входа, 0 - нет, 1 - да
#define USRC_USE_MINUSKEY								1						//использовать клавишу ввода минуса
//#define USRC_USE_TOGGLEMENU_FUNC						1						//использовать функцию, при быстром входе и выходе из меню

#define USRC_UPKEY										'2'						//клавиша вверх
#define USRC_DOWNKEY									'8'						//клавиша вниз
#define USRC_LEFTKEY									'4'						//клавиша влево
#define USRC_RIGHTKEY									'6'						//клавиша вправо
#define USRC_ENTERKEY_1									'='						//клавиша входа и ввода
#define USRC_ENTERKEY_2									'5'						//альтернативная клавиша входа
#define USRC_RETURNKEY									'b'						//клавиша возвращения или стирания
#define USRC_TOGGLEMENU_KEY								'c'						//клавиша быстрого входа и выхода из меню
#define USRC_MINUSKEY									'.'						//клавиша '-'

//------------------------------------------------------------------------------
//текстовый редактор
//------------------------------------------------------------------------------

#define USRC_USE_TEXT_EDITOR							1						//использование текстового редактора
		#define ___USRC_EXT				1										//внешний буфер
		#define ___USRC_LARGE_RAM		2										//большой буфер (больше длины строки)
		#define ___USRC_SMALL_RAM		3										//маленький буфер (меньше равно длине строки)
	#define USRC_TEXT_BUF_TYPE							___USRC_LARGE_RAM		//тип буфера для ввода текста

	#define ___USRC_UKR					1
	#define ___USRC_RUS					2
#define USRC_LANGUAGE									___USRC_RUS				//основной язык

//------------------------------------------------------------------------------
//работа с датой и временем
//------------------------------------------------------------------------------

#define USRC_USE_FULL_DATE				1										//использовать полную дату

#define USRC_DEF_D						'2','0'									//дата по умолчанию
#define USRC_DEF_M						'1','2'
#define USRC_DEF_Y						'2','0','1','2'

//------------------------------------------------------------------------------
//работа со строками
//------------------------------------------------------------------------------

	#define ___USRC_2_STR				2
	#define ___USRC_4_STR				4
	#define ___USRC_6_STR				6
	#define ___USRC_8_STR				8
#define USRC_STRNUM										___USRC_2_STR			//количество используемых строк

#define USRC_INPUT_RAM_STR_SIZE							31						//размер строки ввода
#define USRC_WRT_TYPE_TITLE_STR							DSP_STR_SPACE_PUTTED	//тип заглавной строки WRT
#define USRC_MENU_TYPE_TITLE_STR						DSP_STR_STAR_PUTTED		//тип заглавной строки MENU
#define USRC_MSG_TYPE_TITLE_STR							DSP_STR_WOW_PUTTED		//тип заглавной строки MSG
#define USRC_TYPE_ITEM_STR								DSP_STR_SPACE_PUTTED	//тип строки пункта не выбранного
#define USRC_TYPE_ACTITEM_STR							DSP_STR_SPACE_PUTTED	//тип активной строки пункта (текущей)

//------------------------------------------------------------------------------
//работа с сообщениями
//-`-----------------------------------------------------------------------------

#define USRC_USE_ADD_MSG_SIGNAL							0						//использовать дополнительный сигнал сообщения
#define USRC_USE_ASK_MSG								0						//использование сообщения типа ASK
#define USRC_MSG_TIME									4.0						//время отображения сообщения

//------------------------------------------------------------------------------
//работа с символами
//------------------------------------------------------------------------------

#define USRC_PSW_SYM									DSP_SPEC_STR + 5		//символ отображаемый при вводе пароля
#define USRC_PROGRESS_FULL_SYM							DSPC_SYM_PROGRESS_FUL
#define USRC_PROGRESS_EMPTY_SYM							DSPC_SYM_PROGRESS_EMP

//------------------------------------------------------------------------------
//использование памяти
//------------------------------------------------------------------------------

#define USRC_RETURN_STACK_SIZE							20						//размер стека возвращения из меню
//#define usrcs_										flash_					//спецификатор памяти расположения строк
#define usrcw_											flash_
//спецификатор памяти расположения окон
typedef DSPC_STR_										USRC_STR_;				//тип памяти строк (flash или eeprom)

//------------------------------------------------------------------------------
//курсор
//------------------------------------------------------------------------------

	#define ___USRC_INDICATOR_CURSOR	1
	#define ___USRC_SYM_CURSOR			2
	
#define USRC_CURSOR										___USRC_SYM_CURSOR		//использование курсора

#define USRC_CURSOR_SYM									DSP_SPEC_STR+0			//символ курсора

//------------------------------------------------------------------------------
//DISP REFRESH FREQUENCY
//------------------------------------------------------------------------------

#define ___USRC_ONE_SYSTICK             1
#define ___USRC_TWO_SYSTICK             2

#define USRC_DISP_REFRESH_FRQ           ___USRC_TWO_SYSTICK

#endif
