#include "wdt.h"


//------------------------------------------------------------------------------
//рабочие регистры
//------------------------------------------------------------------------------

#define CTRL_RG								WDTCR								//регистр контроля WDT
#define TURN_OFF_EBL_BIT					4									//бит разрешения изменений WDT
#define EBL_BIT								3									//бит разрешения WDT
#define WDP2_BIT							2									//бит настройки предделителя
#define WDP1_BIT							1									//бит настройки предделителя
#define WDP0_BIT							0									//бит настройки предделителя

//------------------------------------------------------------------------------
//работа с регистрами
//------------------------------------------------------------------------------
																				
#define SET_EBLBIT()						SETBIT(CTRL_RG, EBL_BIT);			//---устанавливает бит разрешения wdt
#define SET_DBLBIT()						CLRBIT(CTRL_RG, EBL_BIT);			//---снимает бит разрешения wdt
#define EBL_TURNOFF()						SETBIT(CTRL_RG, TURN_OFF_EBL_BIT);	//---разрешает изменения wdt
#define EBL_TIMEOUTSEQ()					SETMSK(CTRL_RG, TIMEOUTMASK);		//---разрешает wdt и изменения wdt

//------------------------------------------------------------------------------
//всякие константы
//------------------------------------------------------------------------------

#define TIMEOUTMASK							BIT(TURN_OFF_EBL_BIT)|BIT(EBL_BIT)	//маска разрешения wdt и изменений wdt
#define WAITE()								for (;;) {}							//вечный цикл

//------------------------------------------------------------------------------
//прототипы
//------------------------------------------------------------------------------

//extern void __exit(void);

//------------------------------------------------------------------------------
//внешние функции
//------------------------------------------------------------------------------

void wdt_On(void)
//---инициализирует сторожевой таймер
{
	wdt_Reset_Time(___WDT_1800);
}


void wdt_Off(void)
//---запрещает сторожевой таймер
{
	EBL_TIMEOUTSEQ();
	SET_DBLBIT();
}


void wdt_Reset_Time(uint8_t time)
//---изменяет время прерывания от сторожевого таймера
{
	EBL_TIMEOUTSEQ();
	CTRL_RG = time;
	SET_EBLBIT();
}

void wdt_Reset_Dev_by_Wdt(void) __attribute__((noreturn));
void wdt_Reset_Dev_by_Wdt(void)
//---ресетит прибор с помощю WDT
{
	wdt_Reset_Time(___WDT_0014); 												//настроить сторожевой таймер на самое малое время;
	WAITE();
}
