/* Модуль сторожевого таймера
 * процессор....................................................................atmega128
 * обновлен.....................................................................11.08.2010 14:10:36
*/

#include "pdef.h"
#include <avr/wdt.h>

//------------------------------------------------------------------------------
//комбинации определения времени срабатывания WDT
//------------------------------------------------------------------------------
																				// 3.0 V			5.0 V
#define ___WDT_0014							0									//14.8 ms			14 ms
#define ___WDT_0028							1									//29.6 ms			28.1 ms
#define ___WDT_0056							2									//59.1 ms			56.2 ms
#define ___WDT_0110							3									//0.12 s			0.11 s
#define ___WDT_0220							4									//0.24 s			0.22 s
#define ___WDT_0450							5									//0.47 s			0.45 s
#define ___WDT_0900							6									//0.95 s			0.9 s
#define ___WDT_1800							7									//1.9 s				1.8 s

//------------------------------------------------------------------------------
//внешние функции
//------------------------------------------------------------------------------

void wdt_On(void);																//---инициализирует сторожевой таймер
void wdt_Off(void);																//---запрещает сторожевой таймер
void wdt_Reset_Time(uint8_t time);												//---изменяет время прерывания от сторожевого таймера
void wdt_Reset_Dev_by_Wdt(void);												//---ресетит прибор с помощю WDT

#define WDT_RESET()								wdt_reset()						//---сбрасывает сторожевой таймер
