/* Конфигурационный файл программы СЕКУНДОМЕР
 * обновлен.....................................................................07.12.2010 18:01:15
*/

//------------------------------------------------------------------------------
//звон
//------------------------------------------------------------------------------
#define STWC_RING_TIME							2
//------------------------------------------------------------------------------
//строки
//------------------------------------------------------------------------------
#define STWC_NOTE_TIMEFORWARD					note_timeforward				//строка перед прямым секундомером
#define STWC_NOTE_TIMEBACK						note_timeback					//строки перед обратным секундомером
//------------------------------------------------------------------------------
//сигнализация
//------------------------------------------------------------------------------
#define STWC_USE_SIGNAL							1								//использование сигнала
//------------------------------------------------------------------------------
//соседние окна
//------------------------------------------------------------------------------
#define STW_LEFTWINDOW						wrtW_Bd
#define STW_RIGHTWINDOW						wrtW_LunarPhase




