/* Драйвер температурного датчика DS1631
 * обновлен.....................................................................22.12.2010 12:00:01
*/

#ifndef DS1631_H_
#define DS1631_H_

#include "../ds1631c.h"
#include "../pdef.h"

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------

#define DS1631_DEV_ADR							DS1631C_DEV_ADR					//адрес
#define DS1631_POL								DS1631C_POL						//тип выходного сигнала
#define DS1631_MEAS								DS1631C_MEAS					//тип измерения
#define DS1631_RES								DS1631C_RES						//разрешение

//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------

bool ds1631_Ini(void);															//---инициализация
bool ds1631_Rx_TempCode(int16_t* temp);											//---читает температуру в коде
bool ds1631_Rx_Temp(fl32_t* temp);												//---читает температуру
bool ds1631_Was_Convert(bool* is_conv);											//---проверяет или происходила конверция
int16_t ds1631_Temp_to_Code(fl32_t temp);										//---конвертирует температуру в код
fl32_t ds1631_Code_to_Temp(int16_t code);										//---конвертирует температуру в код

#endif
