/* Модуль контроля меню
 * обновлен.....................................................................06.01.2011 12:44:23
*/


//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------

#define MCTRL_GOTO_MENU						0									//сообщает о переходе в меню
#define MCTRL_GOTO_ALM						1									//сообщает о переходе к будильникам
#define MCTRL_GOTO_RMD						2									//сообщает о переходе к напоминалкам
#define MCTRL_GOTO_PSW						3									//сообщает о переходе к вводу парол

#define MCTRL_DEF_INPUT						0									//используется ввод по умолчанию
#define MCTRL_ALT_INPUT						1									//используется альтернативный ввод

//------------------------------------------------------------------------------
//функции
//------------------------------------------------------------------------------

void menu_Ini(void);
